{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "dtype": "float32", "filters": 32, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "activation": "relu", "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "trainable": true, "name": "conv2d_1", "batch_input_shape": [null, 1, 28, 28], "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "dtype": "float32", "filters": 15, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activation": "relu", "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first", "trainable": true, "name": "conv2d_2", "batch_input_shape": [null, 1, 28, 28], "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null, "rate": 0.2}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "trainable": true, "units": 128, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "trainable": true, "units": 50, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "trainable": true, "units": 10, "name": "dense_3", "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}], "backend": "tensorflow", "keras_version": "2.1.6"}