{"config": [{"config": {"name": "conv2d_7", "kernel_size": [3, 3], "dtype": "float32", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "batch_input_shape": [null, 28, 28, 1], "filters": 28, "padding": "valid", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_5", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_8", "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "filters": 28, "padding": "valid", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_6", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_3", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_5", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "units": 512, "activation": "relu", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dense_6", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "units": 25, "activation": "softmax", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}