{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "kernel_constraint": null, "dilation_rate": [1, 1], "name": "conv2d_10", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_9", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_11", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "filters": 64}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_10", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_12", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "filters": 128}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_11", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_13", "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "filters": 128}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_12", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"units": 512, "name": "dense_5", "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"units": 7, "name": "dense_6", "use_bias": true, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true}}]}